app/controllers/pages_controller.rb

SELECT `pages`.* FROM `pages` ORDER BY pages.position ASC
---
  def list
    @pages = Page.order("pages.position ASC")

SELECT COUNT(*) FROM `pages`
SELECT `subjects`.* FROM `subjects`
---
  def new
    @page = Page.new
    @page_count = Page.count + 1
    @subjects_all_collect = Subject.all.collect

INSERT INTO `pages` (`subject_id`, `name`, `permalink`, `position`, `visible`, `created_at`, `updated_at`) VALUES (NULL, 'Third Page', NULL, 3, 0, '2012-01-30 20:20:49', '2012-01-30 20:20:49')
---
  def create
    #instantiate a new object using form parameters
    @page = Page.new(params[:page])
    #save the object
    if @page.save

SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 2 LIMIT 1
SELECT COUNT(*) FROM `pages`
SELECT `subjects`.* FROM `subjects`
---
  def edit
    @page = Page.find(params[:id])
    @page_count = Page.count
    @subjects_all_collect = Subject.all.collect

SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 2 LIMIT 1
UPDATE `pages` SET `visible` = 1, `updated_at` = '2012-01-30 20:20:54' WHERE `pages`.`id` = 2
---
  def update
    #Find a new object using form parameters
    @page = Page.find(params[:id])
    #save the object
    if @page.update_attributes(params[:page])

SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 2 LIMIT 1
---
  def delete
    @page = Page.find(params[:id])