app/controllers/sections_controller.rb

SELECT `sections`.* FROM `sections` ORDER BY sections.position ASC
---
  def list
    @sections = Section.order("sections.position ASC")

SELECT COUNT(*) FROM `sections`
SELECT `pages`.* FROM `pages`
---
  def new
    @section = Section.new
    @sections_count = Section.count + 1
    @pages_all_collect = Page.all.collect

INSERT INTO `sections` (`page_id`, `name`, `position`, `visible`, `content_type`, `content`, `created_at`, `updated_at`) VALUES (NULL, 'First Section', 1, 1, NULL, NULL, '2012-01-30 20:15:45', '2012-01-30 20:15:45')
---
  def create
    #instantiate a new object using form parameters
    @section = Section.new(params[:section])
    #save the object
    if @section.save

SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `sections`
SELECT `pages`.* FROM `pages`
---
  def edit
    @section = Section.find(params[:id])
    @sections_count = Section.count
    @pages_all_collect = Page.all.collect

SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 4 LIMIT 1
UPDATE `sections` SET `content_type` = 'text', `content` = 'This is sample content.', `updated_at` = '2012-01-30 22:25:31' WHERE `sections`.`id` = 2
---
  def update
    #Find a new object using form parameters
    @section = Section.find(params[:id])
    #save the object
    if @section.update_attributes(params[:section])

DELETE FROM `sections` WHERE `sections`.`id` = 1
SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
---
  def destroy
    Section.find(params[:id]).destroy