app/controllers/subjects_controller.rb

SELECT `subjects`.* FROM `subjects` ORDER BY subjects.position ASC
---
  def list
    @subjects = Subject.order("subjects.position ASC")

SELECT COUNT(*) FROM `subjects`
---
  def new
    @subject = Subject.new
    @subject_count = Subject.count + 1

INSERT INTO `subjects` (`name`, `position`, `visible`, `created_at`, `updated_at`) VALUES ('Test Subject', 8, 0, '2012-01-30 04:45:00', '2012-01-30 04:45:00')
SELECT COUNT(*) FROM `subjects`
---
  def create
    #instantiate a new object using form parameters
    @subject = Subject.new(params[:subject])
    #save the object
    if @subject.save
      #if the save succeeds, redirect to the list action
      flash[:notice] = "Subject Created!"
      redirect_to(:action => 'list')
    else
      #if the save fails, redisplay the form so user can fix problems
      @subject_count = Subject.count + 1

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 5 LIMIT 1
UPDATE `subjects` SET `name` = 'Test Subject`', `updated_at` = '2012-01-30 19:17:09' WHERE `subjects`.`id` = 5
---
  def update
    #Find a new object using form parameters
    @subject = Subject.find(params[:id])
    #save the object
    if @subject.update_attributes(params[:subject])

DELETE FROM `subjects` WHERE `subjects`.`id` = 5
SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 5 LIMIT 1
---
  def destroy
    Subject.find(params[:id]).destroy